ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support.ino
char* ResponseGetTime(uint32_t format, char* time_str)
{
  switch (format) {
  case 1:
    snprintf_P(time_str, TIMESZ, PSTR("{\"" D_JSON_TIME "\":\"%s\",\"Epoch\":%u"), GetDateAndTime(DT_LOCAL).c_str(), UtcTime());
    break;
  case 2:
    snprintf_P(time_str, TIMESZ, PSTR("{\"" D_JSON_TIME "\":%u"), UtcTime());
    break;
  case 3:
    snprintf_P(time_str, TIMESZ, PSTR("{\"" D_JSON_TIME "\":\"%s\""), GetDateAndTime(DT_LOCAL_MILLIS).c_str());
    break;
  default:
    snprintf_P(time_str, TIMESZ, PSTR("{\"" D_JSON_TIME "\":\"%s\""), GetDateAndTime(DT_LOCAL).c_str());
  }
  return time_str;
}

char* ResponseData(void) {
#ifdef MQTT_DATA_STRING
  return (char*)FirmwareGlobal.mqtt_data.c_str();
#else
  return FirmwareGlobal.mqtt_data;
#endif
}

uint32_t ResponseSize(void) {
#ifdef MQTT_DATA_STRING
  return MAX_LOGSZ;                            // Arbitratry max length satisfying full log entry
#else
  return sizeof(FirmwareGlobal.mqtt_data);
#endif
}

uint32_t ResponseLength(void) {
#ifdef MQTT_DATA_STRING
  return FirmwareGlobal.mqtt_data.length();
#else
  return strlen(FirmwareGlobal.mqtt_data);
#endif
}

void ResponseClear(void) {
  // Reset string length to zero
#ifdef MQTT_DATA_STRING
  FirmwareGlobal.mqtt_data = "";
//  FirmwareGlobal.mqtt_data = (const char*) nullptr;  // Doesn't work on ESP32 as strlen() (in MqttPublishPayload) will fail (for obvious reasons)
#else
  FirmwareGlobal.mqtt_data[0] = '\0';
#endif
}

void ResponseJsonStart(void) {
  // Insert a JSON start bracket {
#ifdef MQTT_DATA_STRING
  FirmwareGlobal.mqtt_data.setCharAt(0,'{');
#else
  FirmwareGlobal.mqtt_data[0] = '{';
#endif
}

int Response_P(const char* format, ...)        // Content send snprintf_P char data
{
  // This uses char strings. Be aware of sending %% if % is needed
#ifdef MQTT_DATA_STRING
  va_list arg;
  va_start(arg, format);
  char* mqtt_data = ext_vsnprintf_malloc_P(format, arg);
  va_end(arg);
  if (mqtt_data != nullptr) {
    FirmwareGlobal.mqtt_data = mqtt_data;
    free(mqtt_data);
  } else {
    FirmwareGlobal.mqtt_data = "";
  }
  return FirmwareGlobal.mqtt_data.length();
#else
  va_list args;
  va_start(args, format);
  int len = ext_vsnprintf_P(FirmwareGlobal.mqtt_data, ResponseSize(), format, args);
  va_end(args);
  return len;
#endif
}

int ResponseTime_P(const char* format, ...)    // Content send snprintf_P char data
{
  // This uses char strings. Be aware of sending %% if % is needed
#ifdef MQTT_DATA_STRING
  char timestr[100];
  FirmwareGlobal.mqtt_data = ResponseGetTime(Settings->flag2.time_format, timestr);

  va_list arg;
  va_start(arg, format);
  char* mqtt_data = ext_vsnprintf_malloc_P(format, arg);
  va_end(arg);
  if (mqtt_data != nullptr) {
    FirmwareGlobal.mqtt_data += mqtt_data;
    free(mqtt_data);
  }
  return FirmwareGlobal.mqtt_data.length();
#else
  va_list args;
  va_start(args, format);

  ResponseGetTime(Settings->flag2.time_format, FirmwareGlobal.mqtt_data);

  int mlen = ResponseLength();
  int len = ext_vsnprintf_P(FirmwareGlobal.mqtt_data + mlen, ResponseSize() - mlen, format, args);
  va_end(args);
  return len + mlen;
#endif
}

int ResponseAppend_P(const char* format, ...)  // Content send snprintf_P char data
{
  // This uses char strings. Be aware of sending %% if % is needed
#ifdef MQTT_DATA_STRING
  va_list arg;
  va_start(arg, format);
  char* mqtt_data = ext_vsnprintf_malloc_P(format, arg);
  va_end(arg);
  if (mqtt_data != nullptr) {
    FirmwareGlobal.mqtt_data += mqtt_data;
    free(mqtt_data);
  }
  return FirmwareGlobal.mqtt_data.length();
#else
  va_list args;
  va_start(args, format);
  int mlen = ResponseLength();
  int len = ext_vsnprintf_P(FirmwareGlobal.mqtt_data + mlen, ResponseSize() - mlen, format, args);
  va_end(args);
  return len + mlen;
#endif
}

int ResponseAppendTimeFormat(uint32_t format)
{
  char time_str[TIMESZ];
  return ResponseAppend_P(ResponseGetTime(format, time_str));
}

int ResponseAppendTime(void)
{
  return ResponseAppendTimeFormat(Settings->flag2.time_format);
}

int ResponseAppendTHD(float f_temperature, float f_humidity)
{
  float dewpoint = CalcTempHumToDew(f_temperature, f_humidity);
  return ResponseAppend_P(PSTR("\"" D_JSON_TEMPERATURE "\":%*_f,\"" D_JSON_HUMIDITY "\":%*_f,\"" D_JSON_DEWPOINT "\":%*_f"),
                          Settings->flag2.temperature_resolution, &f_temperature,
                          Settings->flag2.humidity_resolution, &f_humidity,
                          Settings->flag2.temperature_resolution, &dewpoint);
}

int ResponseJsonEnd(void)
{
  return ResponseAppend_P(PSTR("}"));
}

int ResponseJsonEndEnd(void)
{
  return ResponseAppend_P(PSTR("}}"));
}

bool ResponseContains_P(const char* needle) {
/*
#ifdef MQTT_DATA_STRING
  return (strstr_P(FirmwareGlobal.mqtt_data.c_str(), needle) != nullptr);
#else
  return (strstr_P(FirmwareGlobal.mqtt_data, needle) != nullptr);
#endif
*/
  return (strstr_P(ResponseData(), needle) != nullptr);
}

/*********************************************************************************************\
 * GPIO Module and Template management
\*********************************************************************************************/

#ifdef ESP8266
uint16_t GpioConvert(uint8_t gpio) {
  if (gpio >= nitems(kGpioConvert)) {
    return AGPIO(GPIO_USER);
  }
  return pgm_read_word(kGpioConvert + gpio);
}

uint16_t Adc0Convert(uint8_t adc0) {
  if (adc0 > 7) {
    return AGPIO(GPIO_USER);
  }
  else if (0 == adc0) {
    return GPIO_NONE;
  }
  return AGPIO(GPIO_ADC_INPUT + adc0 -1);
}

void TemplateConvert(uint8_t template8[], uint16_t template16[]) {
  for (uint32_t i = 0; i < (sizeof(mytmplt) / 2) -2; i++) {
    template16[i] = GpioConvert(template8[i]);
  }
  template16[(sizeof(mytmplt) / 2) -2] = Adc0Convert(template8[sizeof(mytmplt8285) -1]);
}

void ConvertGpios(void) {
  if (Settings->gpio16_converted != 0xF5A0) {
    // Convert 8-bit user template
    TemplateConvert((uint8_t*)&Settings->ex_user_template8, (uint16_t*)&Settings->user_template);

    for (uint32_t i = 0; i < sizeof(Settings->ex_my_gp8.io); i++) {
      Settings->my_gp.io[i] = GpioConvert(Settings->ex_my_gp8.io[i]);
    }
    Settings->my_gp.io[(sizeof(myio) / 2) -1] = Adc0Convert(Settings->ex_my_adc0);
    Settings->gpio16_converted = 0xF5A0;
  }
}
#endif  // ESP8266

int IRAM_ATTR Pin(uint32_t gpio, uint32_t index = 0);
int IRAM_ATTR Pin(uint32_t gpio, uint32_t index) {
  uint16_t real_gpio = gpio << 5;
  uint16_t mask = 0xFFE0;
  if (index < GPIO_ANY) {
    real_gpio += index;
    mask = 0xFFFF;
  }
  for (uint32_t i = 0; i < nitems(FirmwareGlobal.gpio_pin); i++) {
    if ((FirmwareGlobal.gpio_pin[i] & mask) == real_gpio) {
      return i;              // Pin number configured for gpio
    }
  }
  return -1;                 // No pin used for gpio
}

bool PinUsed(uint32_t gpio, uint32_t index = 0);
bool PinUsed(uint32_t gpio, uint32_t index) {
  return (Pin(gpio, index) >= 0);
}

