ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support.ino
void SetNextTimeInterval(uint32_t& timer, const uint32_t step)
{
  timer += step;
  const long passed = TimePassedSince(timer);
  if (passed < 0) { return; }   // Event has not yet happened, which is fine.
  if (static_cast<unsigned long>(passed) > step) {
    // No need to keep running behind, start again.
    timer = millis() + step;
    return;
  }
  // Try to get in sync again.
  timer = millis() + (step - passed);
}

int32_t TimePassedSinceUsec(uint32_t timestamp)
{
  return TimeDifference(timestamp, micros());
}

bool TimeReachedUsec(uint32_t timer)
{
  // Check if a certain timeout has been reached.
  const long passed = TimePassedSinceUsec(timer);
  return (passed >= 0);
}

/*********************************************************************************************\
 * Syslog
 *
 * Example:
 *   AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_LOG "Any value %d"), value);
 *
\*********************************************************************************************/

void SetTasConlog(uint32_t loglevel) {
  Settings->seriallog_level = loglevel;
  FirmwareGlobal.seriallog_level = loglevel;
  FirmwareGlobal.seriallog_timer = 0;
}

void SetSeriallog(uint32_t loglevel) {
#ifdef ESP32
  if (tasconsole_serial) {
#endif  // ESP32

  SetTasConlog(loglevel);

#ifdef ESP32
  }
#endif  // ESP32
}

void SetSyslog(uint32_t loglevel)
{
  Settings->syslog_level = loglevel;
  FirmwareGlobal.syslog_level = loglevel;
  FirmwareGlobal.syslog_timer = 0;
}

void SyslogAsync(bool refresh) {
  static IPAddress syslog_host_addr;      // Syslog host IP address
  static uint32_t syslog_host_hash = 0;   // Syslog host name hash
  static uint32_t index = 1;

  if (!FirmwareGlobal.syslog_level || FirmwareGlobal.global_state.network_down) { return; }
  if (refresh && !NeedLogRefresh(FirmwareGlobal.syslog_level, index)) { return; }

  char* line;
  size_t len;
  while (GetLog(FirmwareGlobal.syslog_level, &index, &line, &len)) {
    // 00:00:02.096 HTP: Web server active on wemos5 with IP address 192.168.2.172
    //              HTP: Web server active on wemos5 with IP address 192.168.2.172
    uint32_t mxtime = strchr(line, ' ') - line +1;  // Remove mxtime
    if (mxtime > 0) {
      uint32_t current_hash = GetHash(SettingsText(SET_SYSLOG_HOST), strlen(SettingsText(SET_SYSLOG_HOST)));
      if (syslog_host_hash != current_hash) {
        IPAddress temp_syslog_host_addr;
        if (!WifiHostByName(SettingsText(SET_SYSLOG_HOST), temp_syslog_host_addr)) {  // If sleep enabled this might result in exception so try to do it once using hash
          FirmwareGlobal.syslog_level = 0;
          FirmwareGlobal.syslog_timer = SYSLOG_TIMER;
          AddLog(LOG_LEVEL_INFO, PSTR("SLG: " D_RETRY_IN " %d " D_UNIT_SECOND), SYSLOG_TIMER);
          return;
        }
        syslog_host_hash = current_hash;
        syslog_host_addr = temp_syslog_host_addr;
      }
      if (!PortUdp.beginPacket(syslog_host_addr, Settings->syslog_port)) {
        FirmwareGlobal.syslog_level = 0;
        FirmwareGlobal.syslog_timer = SYSLOG_TIMER;
        AddLog(LOG_LEVEL_INFO, PSTR("SLG: " D_SYSLOG_HOST_NOT_FOUND ". " D_RETRY_IN " %d " D_UNIT_SECOND), SYSLOG_TIMER);
        return;
      }

      char header[64];
      snprintf_P(header, sizeof(header), PSTR("%s ESP-"), NetworkHostname());
      char* line_start = line +mxtime;
#ifdef ESP8266
      // Packets over 1460 bytes are not send
      uint32_t line_len;
      int32_t log_len = len -mxtime -1;
      while (log_len > 0) {
        PortUdp.write(header);
        line_len = (log_len > 1460) ? 1460 : log_len;
        PortUdp.write((uint8_t*)line_start, line_len);
        PortUdp.endPacket();
        log_len -= 1460;
        line_start += 1460;
      }
#else
      PortUdp.write((const uint8_t*)header, strlen(header));
      PortUdp.write((uint8_t*)line_start, len -mxtime -1);
      PortUdp.endPacket();
#endif

      delay(1);                          // Add time for UDP handling (#5512)
    }
  }
}

bool NeedLogRefresh(uint32_t req_loglevel, uint32_t index) {
  if (!FirmwareGlobal.log_buffer) { return false; }  // Leave now if there is no buffer available

#ifdef ESP32
  // this takes the mutex, and will be release when the class is destroyed -
  // i.e. when the functon leaves  You CAN call mutex.give() to leave early.
  TasAutoMutex mutex((SemaphoreHandle_t *)&FirmwareGlobal.log_buffer_mutex);
#endif  // ESP32

  // Skip initial buffer fill
  if (strlen(FirmwareGlobal.log_buffer) < LOG_BUFFER_SIZE / 2) { return false; }

  char* line;
  size_t len;
  if (!GetLog(req_loglevel, &index, &line, &len)) { return false; }
  return ((line - FirmwareGlobal.log_buffer) < LOG_BUFFER_SIZE / 4);
}

bool GetLog(uint32_t req_loglevel, uint32_t* index_p, char** entry_pp, size_t* len_p) {
  if (!FirmwareGlobal.log_buffer) { return false; }  // Leave now if there is no buffer available
  if (FirmwareGlobal.uptime < 3) { return false; }   // Allow time to setup correct log level

  uint32_t index = *index_p;
  if (!req_loglevel || (index == FirmwareGlobal.log_buffer_pointer)) { return false; }

#ifdef ESP32
  // this takes the mutex, and will be release when the class is destroyed -
  // i.e. when the functon leaves  You CAN call mutex.give() to leave early.
  TasAutoMutex mutex((SemaphoreHandle_t *)&FirmwareGlobal.log_buffer_mutex);
#endif  // ESP32

  if (!index) {                            // Dump all
    index = FirmwareGlobal.log_buffer[0];
  }

  do {
    size_t len = 0;
    uint32_t loglevel = 0;
    char* entry_p = FirmwareGlobal.log_buffer;
    do {
      uint32_t cur_idx = *entry_p;
      entry_p++;
      size_t tmp = strchrspn(entry_p, '\1');
      tmp++;                               // Skip terminating '\1'
      if (cur_idx == index) {              // Found the requested entry
        loglevel = *entry_p - '0';
        entry_p++;                         // Skip loglevel
        len = tmp -1;
        break;
      }
      entry_p += tmp;
    } while (entry_p < FirmwareGlobal.log_buffer + LOG_BUFFER_SIZE && *entry_p != '\0');
    index++;
    if (index > 255) { index = 1; }        // Skip 0 as it is not allowed
    *index_p = index;
    if ((len > 0) &&
        (loglevel <= req_loglevel) &&
        (FirmwareGlobal.masterlog_level <= req_loglevel)) {
      *entry_pp = entry_p;
      *len_p = len;
      return true;
    }
    delay(0);
  } while (index != FirmwareGlobal.log_buffer_pointer);
  return false;
}

void AddLogData(uint32_t loglevel, const char* log_data, const char* log_data_payload = nullptr, const char* log_data_retained = nullptr) {
  if (!FirmwareGlobal.enable_logging) { return; }
  // Store log_data in buffer
  // To lower heap usage log_data_payload may contain the payload data from MqttPublishPayload()
  //  and log_data_retained may contain optional retained message from MqttPublishPayload()
#ifdef ESP32
  // this takes the mutex, and will be release when the class is destroyed -
  // i.e. when the functon leaves  You CAN call mutex.give() to leave early.
  TasAutoMutex mutex((SemaphoreHandle_t *)&FirmwareGlobal.log_buffer_mutex);
#endif  // ESP32

  char mxtime[21];  // "13:45:21.999-123/12 "
  snprintf_P(mxtime, sizeof(mxtime), PSTR("%02d" D_HOUR_MINUTE_SEPARATOR "%02d" D_MINUTE_SECOND_SEPARATOR "%02d.%03d"),
    RtcTime.hour, RtcTime.minute, RtcTime.second, RtcMillis());
  if (Settings->flag5.show_heap_with_timestamp) {
#ifdef ESP8266
    snprintf_P(mxtime, sizeof(mxtime), PSTR("%s-%03d"),
      mxtime, ESP_getFreeHeap1024());
#else
    snprintf_P(mxtime, sizeof(mxtime), PSTR("%s-%03d/%02d"),
      mxtime, ESP_getFreeHeap1024(), ESP_getHeapFragmentation());
#endif
  }
  strcat(mxtime, " ");

  char empty[2] = { 0 };
  if (!log_data_payload) { log_data_payload = empty; }
  if (!log_data_retained) { log_data_retained = empty; }

  if ((loglevel <= FirmwareGlobal.seriallog_level) &&
      (FirmwareGlobal.masterlog_level <= FirmwareGlobal.seriallog_level)) {
    TasConsole.printf("%s%s%s%s\r\n", mxtime, log_data, log_data_payload, log_data_retained);
#ifdef USE_SERIAL_BRIDGE
    SerialBridgePrintf("%s%s%s%s\r\n", mxtime, log_data, log_data_payload, log_data_retained);
#endif  // USE_SERIAL_BRIDGE
  }

  if (!FirmwareGlobal.log_buffer) { return; }  // Leave now if there is no buffer available

  uint32_t highest_loglevel = Settings->weblog_level;
  if (Settings->mqttlog_level > highest_loglevel) { highest_loglevel = Settings->mqttlog_level; }
  if (FirmwareGlobal.syslog_level > highest_loglevel) { highest_loglevel = FirmwareGlobal.syslog_level; }
  if (FirmwareGlobal.templog_level > highest_loglevel) { highest_loglevel = FirmwareGlobal.templog_level; }
  if (FirmwareGlobal.uptime < 3) { highest_loglevel = LOG_LEVEL_DEBUG_MORE; }  // Log all before setup correct log level

  if ((loglevel <= highest_loglevel) &&    // Log only when needed
      (FirmwareGlobal.masterlog_level <= highest_loglevel)) {
    // Delimited, zero-terminated buffer of log lines.
    // Each entry has this format: [index][loglevel][log data]['\1']

    // Truncate log messages longer than MAX_LOGSZ which is the log buffer size minus 64 spare
    uint32_t log_data_len = strlen(log_data) + strlen(log_data_payload) + strlen(log_data_retained);
    char too_long[TOPSZ];
    if (log_data_len > MAX_LOGSZ) {
      snprintf_P(too_long, sizeof(too_long) - 20, PSTR("%s%s"), log_data, log_data_payload);   // 20 = strlen("... 123456 truncated")
      snprintf_P(too_long, sizeof(too_long), PSTR("%s... %d truncated"), too_long, log_data_len);
      log_data = too_long;
      log_data_payload = empty;
      log_data_retained = empty;
    }

    FirmwareGlobal.log_buffer_pointer &= 0xFF;
    if (!FirmwareGlobal.log_buffer_pointer) {
      FirmwareGlobal.log_buffer_pointer++;  // Index 0 is not allowed as it is the end of char string
    }
    while (FirmwareGlobal.log_buffer_pointer == FirmwareGlobal.log_buffer[0] ||  // If log already holds the next index, remove it
           strlen(FirmwareGlobal.log_buffer) + strlen(log_data) + strlen(log_data_payload) + strlen(log_data_retained) + strlen(mxtime) + 4 > LOG_BUFFER_SIZE)  // 4 = log_buffer_pointer + '\1' + '\0'
    {
      char* it = FirmwareGlobal.log_buffer;
      it++;                                // Skip log_buffer_pointer
      it += strchrspn(it, '\1');           // Skip log line
      it++;                                // Skip delimiting "\1"
      memmove(FirmwareGlobal.log_buffer, it, LOG_BUFFER_SIZE -(it-FirmwareGlobal.log_buffer));  // Move buffer forward to remove oldest log line
    }
    snprintf_P(FirmwareGlobal.log_buffer, LOG_BUFFER_SIZE, PSTR("%s%c%c%s%s%s%s\1"),
      FirmwareGlobal.log_buffer, FirmwareGlobal.log_buffer_pointer++, '0'+loglevel, mxtime, log_data, log_data_payload, log_data_retained);
    FirmwareGlobal.log_buffer_pointer &= 0xFF;
    if (!FirmwareGlobal.log_buffer_pointer) {
      FirmwareGlobal.log_buffer_pointer++;  // Index 0 is not allowed as it is the end of char string
    }
  }
}

void AddLog(uint32_t loglevel, PGM_P formatP, ...) {
  uint32_t highest_loglevel = FirmwareGlobal.seriallog_level;
  if (Settings->weblog_level > highest_loglevel) { highest_loglevel = Settings->weblog_level; }
  if (Settings->mqttlog_level > highest_loglevel) { highest_loglevel = Settings->mqttlog_level; }
  if (FirmwareGlobal.syslog_level > highest_loglevel) { highest_loglevel = FirmwareGlobal.syslog_level; }
  if (FirmwareGlobal.templog_level > highest_loglevel) { highest_loglevel = FirmwareGlobal.templog_level; }
  if (FirmwareGlobal.uptime < 3) { highest_loglevel = LOG_LEVEL_DEBUG_MORE; }  // Log all before setup correct log level

  // If no logging is requested then do not access heap to fight fragmentation
  if ((loglevel <= highest_loglevel) && (FirmwareGlobal.masterlog_level <= highest_loglevel)) {
    va_list arg;
    va_start(arg, formatP);
    char* log_data = ext_vsnprintf_malloc_P(formatP, arg);
    va_end(arg);
    if (log_data == nullptr) { return; }

    AddLogData(loglevel, log_data);
    free(log_data);
  }
}

