ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support.ino
void AddLogBuffer(uint32_t loglevel, uint8_t *buffer, uint32_t count) {
  char hex_char[(count * 3) + 2];
  AddLog(loglevel, PSTR("DMP: %s"), ToHex_P(buffer, count, hex_char, sizeof(hex_char), ' '));
}

void AddLogSerial() {
  AddLogBuffer(LOG_LEVEL_DEBUG, (uint8_t*)FirmwareGlobal.serial_in_buffer, FirmwareGlobal.serial_in_byte_counter);
}

void AddLogMissed(const char *sensor, uint32_t misses)
{
  AddLog(LOG_LEVEL_DEBUG, PSTR("SNS: %s missed %d"), sensor, SENSOR_MAX_MISS - misses);
}

void AddLogSpi(bool hardware, uint32_t clk, uint32_t mosi, uint32_t miso) {
  // Needs optimization
  uint32_t enabled = (hardware) ? FirmwareGlobal.spi_enabled : FirmwareGlobal.soft_spi_enabled;
  switch(enabled) {
    case SPI_MOSI:
      AddLog(LOG_LEVEL_INFO, PSTR("SPI: %s using GPIO%02d(CLK) and GPIO%02d(MOSI)"),
        (hardware) ? PSTR("Hardware") : PSTR("Software"), clk, mosi);
      break;
    case SPI_MISO:
      AddLog(LOG_LEVEL_INFO, PSTR("SPI: %s using GPIO%02d(CLK) and GPIO%02d(MISO)"),
        (hardware) ? PSTR("Hardware") : PSTR("Software"), clk, miso);
      break;
    case SPI_MOSI_MISO:
      AddLog(LOG_LEVEL_INFO, PSTR("SPI: %s using GPIO%02d(CLK), GPIO%02d(MOSI) and GPIO%02d(MISO)"),
        (hardware) ? PSTR("Hardware") : PSTR("Software"), clk, mosi, miso);
      break;
  }
}

/*********************************************************************************************\
 * HTML and URL encode
\*********************************************************************************************/

const char kUnescapeCode[] = "&><\"\'\\";
const char kEscapeCode[] PROGMEM = "&amp;|&gt;|&lt;|&quot;|&apos;|&#92;";

String HtmlEscape(const String unescaped) {
  char escaped[10];
  size_t ulen = unescaped.length();
  String result;
  result.reserve(ulen);          // pre-reserve the required space to avoid mutiple reallocations
  for (size_t i = 0; i < ulen; i++) {
    char c = unescaped[i];
    char *p = strchr(kUnescapeCode, c);
    if (p != nullptr) {
      result += GetTextIndexed(escaped, sizeof(escaped), p - kUnescapeCode, kEscapeCode);
    } else {
      result += c;
    }
  }
  return result;
}

String UrlEscape(const char *unescaped) {
  static const char *hex = "0123456789ABCDEF";
  String result;
  result.reserve(strlen(unescaped));

  while (*unescaped != '\0') {
    if (('a' <= *unescaped && *unescaped <= 'z') ||
        ('A' <= *unescaped && *unescaped <= 'Z') ||
        ('0' <= *unescaped && *unescaped <= '9') ||
        *unescaped == '-' || *unescaped == '_' || *unescaped == '.' || *unescaped == '~')
    {
      result += *unescaped;
    }
    else
    {
      result += '%';
      result += hex[*unescaped >> 4];
      result += hex[*unescaped & 0xf];
    }
    unescaped++;
  }
  return result;
}

/*********************************************************************************************\
 * Uncompress static PROGMEM strings
\*********************************************************************************************/

#ifdef USE_UNISHOX_COMPRESSION

#include <unishox.h>

Unishox compressor;

// New variant where you provide the String object yourself
int32_t DecompressNoAlloc(const char * compressed, size_t uncompressed_size, String & content) {
  uncompressed_size += 2;    // take a security margin

  // We use a nasty trick here. To avoid allocating twice the buffer,
  // we first extend the buffer of the String object to the target size (maybe overshooting by 7 bytes)
  // then we decompress in this buffer,
  // and finally assign the raw string to the String, which happens to work: String uses memmove(), so overlapping works
  content.reserve(uncompressed_size);
  char * buffer = content.begin();

  int32_t len = compressor.unishox_decompress(compressed, strlen_P(compressed), buffer, uncompressed_size);
  if (len > 0) {
    buffer[len] = 0;    // terminate string with NULL
    content = buffer;         // copy in place
  }
  return len;
}

String Decompress(const char * compressed, size_t uncompressed_size) {
  String content("");
  DecompressNoAlloc(compressed, uncompressed_size, content);
  return content;
}

#endif // USE_UNISHOX_COMPRESSION
